mod3-project-back-end/app/controllers/paths_controller.rb

SELECT "paths".* FROM "paths"
---
    def index
        # paths = Path.all
        # byebug
        @paths = Path.search(paths_params)

SELECT  "paths".* FROM "paths" WHERE "paths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        path = Path.find_by(id: params[:id])

SELECT  "paths".* FROM "paths" WHERE "paths"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def destroy
        path = Path.find_by(id: params[:id])

SELECT  "paths".* FROM "paths" WHERE "paths"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def update
        path = Path.find_by(id: params[:id])