mod3-project-back-end/app/models/path.rb

SELECT  "paths".* FROM "paths" WHERE "paths"."difficulty" = ? AND "paths"."surface_type" = ? AND "paths"."topography" = ? ORDER BY "paths"."id" ASC LIMIT ?  [["difficulty", 1], ["surface_type", "Wood Chips"], ["topography", "Level"], ["LIMIT", 5]]
---
    def self.search(search)
        # byebug
        if search
            paths = Path.all
            paths = paths.where(difficulty: search["difficulty"])
            paths = paths.where(surface_type: search["surface_type"])
            paths = paths.where(topography: search["topography"])
            # byebug
            return paths.first(5)